Revit 2027 API
ParameterTypeId.AnalyticConstructionGbxmlTypeid Property
 "Construction Type Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticConstructionGbxmlTypeid { get; }
Public Shared ReadOnly Property AnalyticConstructionGbxmlTypeid As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticConstructionGbxmlTypeid {
	ForgeTypeId^ get ();
}
static member AnalyticConstructionGbxmlTypeid : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace